newbiemacs/newbiemacs-tutorial-lv3.org
#+title: Newbiemacs Tutorial: Level 3
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* Newbiemacs key tree
- In *normal mode* press ~SPC~ to invoke the Newbiemacs key tree.
- In *normal mode* press ~,~ to invoke the Newbiemacs local key tree.
- You can also run the key tree by pressing ~<F5>~ or ~<F6>~
- The Newbiemacs (local) key tree will show various commands, which
  you can run by pressing the key indicated there.
* Which-key
- There are many Emacs keybindings starting with ~C-x~ or ~C-c~.
- Press one of these keys will show the possible keybingings.
- In this way you can explore Emacs commands in your own.
* Execute command
- In Emacs there are tons of commands you can execute.
- To do this type ~M-x~ and it will show all possible commands available for you.
- Typing anything in the prompt will narrow down the list of commands
  to those containing what you typed there.
- Instead of ~M-x~ you can also simply type ~SPC SPC~ in *normal
  mode*.

* key bindings
- Here are some basic Emacs keybindings.
| mode   | command                    | keybinding |
|--------+----------------------------+------------|
| all    | isearch-forward            | ~C-s~      |
| all    | query-replace              | ~M-%~      |
| all    | kill-buffer                | ~C-x k~    |
| all    | increase font-size         | ~C-x C-=~  |
| all    | decrease font-size         | ~C-x C--~  |
| all    | default font-size          | ~C-x C-0~  |
| all    | org-store-link             | ~C-c l~    |
| all    | org-insert-link            | ~C-c C-l~  |

* Emacs mode
- There is another mode called *emacs mode*.
- *emacs mode* is indicated with blue color at the bottom left corder.
- To toggle between *emacs mode* and the other mode, press ~C-z~.
- In *emacs mode* you can use the usual Emacs keybindings.
- If you enter other "major modes", such as "help", "dired", or
  "magit", the default mode is *emacs mode*.
- In many of such modes, typing ~?~ shows keybindings in that mode.

* Configurations
** key-tree
- You can add your own keybindings.
- Press ~SPC k u~
- You can see the system keybindings by typing ~SPC k s~.
- However, it is not recommended to modify the system keybindings
  because it will prevent to update Newbiemacs.
** user-init
- You can add your own configurations in the user init file.
- Press ~SPC N c u~

* Further readings
- [[https://www.gnu.org/software/emacs/tour/][A Guided Tour of Emacs]]
- [[https://www.openvim.com/][Interactive Vim tutorial]]
- [[https://orgmode.org/quickstart.html][Quickstart]] for Org-mode
- [[https://orgmode.org/guide/index.html][Org Mode Compact Guide]] (Click [[https://orgmode.org/orgguide.pdf][here]] for a pdf version)

* Links
- [[file:newbiemacs-home.org][Newbiemacs Home]]
- [[file:newbiemacs-tutorial.org][Newbiemacs Tutorial]]
