newbiemacs/newbiemacs-tutorial-lv3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-24 Sat 17:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Newbiemacs Tutorial: Level 3</title>
<meta name="author" content="Jang Soo Kim" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Newbiemacs Tutorial: Level 3</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org05082a1">1. Newbiemacs key tree</a></li>
<li><a href="#org7e2a0e3">2. Which-key</a></li>
<li><a href="#orgc41d811">3. Execute command</a></li>
<li><a href="#org9b360f6">4. key bindings</a></li>
<li><a href="#orgec89974">5. Emacs mode</a></li>
<li><a href="#orgf555d96">6. Configurations</a>
<ul>
<li><a href="#org76291b8">6.1. key-tree</a></li>
<li><a href="#org0ba3cbd">6.2. user-init</a></li>
</ul>
</li>
<li><a href="#org59f3c22">7. Further readings</a></li>
<li><a href="#orge131c98">8. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-org05082a1" class="outline-2">
<h2 id="org05082a1"><span class="section-number-2">1.</span> Newbiemacs key tree</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>In <b>normal mode</b> press <code>SPC</code> to invoke the Newbiemacs key tree.</li>
<li>In <b>normal mode</b> press <code>,</code> to invoke the Newbiemacs local key tree.</li>
<li>You can also run the key tree by pressing <code>&lt;F5&gt;</code> or <code>&lt;F6&gt;</code></li>
<li>The Newbiemacs (local) key tree will show various commands, which
you can run by pressing the key indicated there.</li>
</ul>
</div>
</div>
<div id="outline-container-org7e2a0e3" class="outline-2">
<h2 id="org7e2a0e3"><span class="section-number-2">2.</span> Which-key</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>There are many Emacs keybindings starting with <code>C-x</code> or <code>C-c</code>.</li>
<li>Press one of these keys will show the possible keybingings.</li>
<li>In this way you can explore Emacs commands in your own.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc41d811" class="outline-2">
<h2 id="orgc41d811"><span class="section-number-2">3.</span> Execute command</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>In Emacs there are tons of commands you can execute.</li>
<li>To do this type <code>M-x</code> and it will show all possible commands available for you.</li>
<li>Typing anything in the prompt will narrow down the list of commands
to those containing what you typed there.</li>
<li>Instead of <code>M-x</code> you can also simply type <code>SPC SPC</code> in <b>normal
mode</b>.</li>
</ul>
</div>
</div>

<div id="outline-container-org9b360f6" class="outline-2">
<h2 id="org9b360f6"><span class="section-number-2">4.</span> key bindings</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Here are some basic Emacs keybindings.</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">mode</th>
<th scope="col" class="org-left">command</th>
<th scope="col" class="org-left">keybinding</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">all</td>
<td class="org-left">isearch-forward</td>
<td class="org-left"><code>C-s</code></td>
</tr>

<tr>
<td class="org-left">all</td>
<td class="org-left">query-replace</td>
<td class="org-left"><code>M-%</code></td>
</tr>

<tr>
<td class="org-left">all</td>
<td class="org-left">kill-buffer</td>
<td class="org-left"><code>C-x k</code></td>
</tr>

<tr>
<td class="org-left">all</td>
<td class="org-left">increase font-size</td>
<td class="org-left"><code>C-x C-=</code></td>
</tr>

<tr>
<td class="org-left">all</td>
<td class="org-left">decrease font-size</td>
<td class="org-left"><code>C-x C--</code></td>
</tr>

<tr>
<td class="org-left">all</td>
<td class="org-left">default font-size</td>
<td class="org-left"><code>C-x C-0</code></td>
</tr>

<tr>
<td class="org-left">all</td>
<td class="org-left">org-store-link</td>
<td class="org-left"><code>C-c l</code></td>
</tr>

<tr>
<td class="org-left">all</td>
<td class="org-left">org-insert-link</td>
<td class="org-left"><code>C-c C-l</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgec89974" class="outline-2">
<h2 id="orgec89974"><span class="section-number-2">5.</span> Emacs mode</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>There is another mode called <b>emacs mode</b>.</li>
<li><b>emacs mode</b> is indicated with blue color at the bottom left corder.</li>
<li>To toggle between <b>emacs mode</b> and the other mode, press <code>C-z</code>.</li>
<li>In <b>emacs mode</b> you can use the usual Emacs keybindings.</li>
<li>If you enter other "major modes", such as "help", "dired", or
"magit", the default mode is <b>emacs mode</b>.</li>
<li>In many of such modes, typing <code>?</code> shows keybindings in that mode.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf555d96" class="outline-2">
<h2 id="orgf555d96"><span class="section-number-2">6.</span> Configurations</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org76291b8" class="outline-3">
<h3 id="org76291b8"><span class="section-number-3">6.1.</span> key-tree</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>You can add your own keybindings.</li>
<li>Press <code>SPC k u</code></li>
<li>You can see the system keybindings by typing <code>SPC k s</code>.</li>
<li>However, it is not recommended to modify the system keybindings
because it will prevent to update Newbiemacs.</li>
</ul>
</div>
</div>
<div id="outline-container-org0ba3cbd" class="outline-3">
<h3 id="org0ba3cbd"><span class="section-number-3">6.2.</span> user-init</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>You can add your own configurations in the user init file.</li>
<li>Press <code>SPC N c u</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org59f3c22" class="outline-2">
<h2 id="org59f3c22"><span class="section-number-2">7.</span> Further readings</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/emacs/tour/">A Guided Tour of Emacs</a></li>
<li><a href="https://www.openvim.com/">Interactive Vim tutorial</a></li>
<li><a href="https://orgmode.org/quickstart.html">Quickstart</a> for Org-mode</li>
<li><a href="https://orgmode.org/guide/index.html">Org Mode Compact Guide</a> (Click <a href="https://orgmode.org/orgguide.pdf">here</a> for a pdf version)</li>
</ul>
</div>
</div>

<div id="outline-container-orge131c98" class="outline-2">
<h2 id="orge131c98"><span class="section-number-2">8.</span> Links</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="newbiemacs-home.html">Newbiemacs Home</a></li>
<li><a href="newbiemacs-tutorial.html">Newbiemacs Tutorial</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jang Soo Kim</p>
<p class="date">Created: 2022-12-24 Sat 17:24</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
